"""Решение задачи"""

with open("26_data.txt") as file:
    lines = list(file.readlines())  # сохраняем все строки в список
    team_res = []  # Здесь будем сохранять результаты каждого субъекта

    # Поскольку для каждого региона 2 строки будем идти с шагом в 2
    for i in range(0, len(lines), 2):
        n = int(lines[i])  # Считываем кол-во участников в этом регионе
        balls = [int(el) for el in
                 lines[i + 1].split()]  # Считываем кол-во баллов у этих участников

        balls.sort()  # Сортируем по возрастанию баллы участников
        # Находим балл команды, как сумму баллов трех лучших участников
        # (поскольку сортировали по возрастанию - то это 3 последних элемента)
        team_ball = balls[-1] + balls[-2] + balls[-3]
        team_res.append(team_ball)  # Добавляем в список всех результатов результат нашей команды

    team_res.sort()  # Сортируем по возрастанию баллы всех регионов
    print(team_res[-20])  # Выводим балл 20-й команды по которой формируется проходной балл
